# 从现有数组中生成数组，首先需要有一个数组
import numpy as np
score =([
  [80,89,86,67,79],
  [78,97,89,67,81],
  [90,94,78,67,74],
  [91,91,90,67,69],
  [76,87,75,67,86],
  [70,79,84,67,84],
  [94,92,93,67,64],
  [86,85,83,67,80]
])
score = np.asarray(score)
# 使用三种方法，使用原数组生成新数组
data_1 = np.array(score)
data_2 = np.asarray(score)
data_3 = np.copy(score)

# 生成之后，尝试对原数组进行修改，然后查看三种方法产生的数组是否会变化。
# 例如将第1行第2列的元素进行修改，修改成为999
score[0,1] = 999
# print(score)  # 输出检测原始数据的修改是OK的

# 输出检测三个方法的数据是否随之发生变动
print("data_1 = np.array(score)：\n",data_1)
print("data_2 = np.asarray(score):\n)",data_2)  # 仅此方法随之发生变化
print("data_3 = np.copy(score)\n",data_3)
"""
data_1 = np.array(score)：
 [[80 89 86 67 79]
 [78 97 89 67 81]
 [90 94 78 67 74]
 [91 91 90 67 69]
 [76 87 75 67 86]
 [70 79 84 67 84]
 [94 92 93 67 64]
 [86 85 83 67 80]]
data_2 = np.asarray(score):
) [[ 80 999  86  67  79]
 [ 78  97  89  67  81]
 [ 90  94  78  67  74]
 [ 91  91  90  67  69]
 [ 76  87  75  67  86]
 [ 70  79  84  67  84]
 [ 94  92  93  67  64]
 [ 86  85  83  67  80]]
data_3 = np.copy(score)
 [[80 89 86 67 79]
 [78 97 89 67 81]
 [90 94 78 67 74]
 [91 91 90 67 69]
 [76 87 75 67 86]
 [70 79 84 67 84]
 [94 92 93 67 64]
 [86 85 83 67 80]]
"""
