# 我将在这个文件内，进行字典这个数据容器的相关操作的练习
# 根据指定的员工信息，用字典完成数据的记录。
# 记录完毕之后，通过for循环，对所有级别为1的员工，级别上升1级，薪水增加1000元。
worker = {  "王力宏":{"部门":"科技部","工资":3000,"级别":1},
            "周杰伦":{"部门":"市场部","工资":5000,"级别":2},
            "林俊杰":{"部门":"市场部","工资":7000,"级别":3},
            "张学友":{"部门":"科技部","工资":4000,"级别":1},
            "刘德华":{"部门":"市场部","工资":6000,"级别":2}
         }
print(f"全体员工当前信息如下，\n{worker}")
for name in worker:
# 第一层循环x实际上赋值的是单个员工的信息，是个字典类型
    if worker[name]["级别"]== 1:
        worker[name]["级别"] += 1
        worker[name]["工资"] += 1000
        # worker[name]["科技部"] += 1000
print(f"全体员工升职加薪之后信息如下，\n{worker}")

